app/controllers/friends_controller.rb

UPDATE "friends" SET "first_name" = $1, "last_name" = $2, "updated_at" = $3 WHERE "friends"."id" = $4  [["first_name", "Kanye"], ["last_name", "Westinghouser"], ["updated_at", "2022-05-12 19:25:49.358260"], ["id", 20]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."user_id" = $2 LIMIT $3  [["friend_id", 20], ["user_id", 12], ["LIMIT", 1]]
UPDATE "friendships" SET "communication_reminder_interval" = $1, "communication_max" = $2, "updated_at" = $3 WHERE "friendships"."id" = $4  [["communication_reminder_interval", 3], ["communication_max", 11], ["updated_at", "2022-05-12 19:28:02.369340"], ["id", 35]]
---
  def update
    @friend.update!(friend_params)
    @friend.friendships.find_by!(user: @current_user).update!(friendship_params)

SELECT "friends".* FROM "friends" WHERE "friends"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]
---
  def find_friend
    @friend = Friend.find(params[:id])