app/controllers/groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = $1  [["user_id", 12]]
---
  def index
    groups = Group.where(user_id: session[:user_id])