app/controllers/interactions_controller.rb

  def index
    interactions = Interaction.where(user_id: session[:user_id])
---
SELECT "interactions".* FROM "interactions" WHERE "interactions"."user_id" = $1  [["user_id", 12]]

  def create
    new_interaction = @current_user.interactions.create!(interaction_params)
---
INSERT INTO "interactions" ("created_at", "updated_at", "user_id", "friend_id", "in_person?", "date", "location_or_method", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"