app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "first_name", "last_name", "email", "password_digest") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        user = User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        if params[:id]
        user = User.find_by(id: params[:id])
            render json: user
        else
        user = User.find_by(id: session[:user_id])