app/models/friendship.rb

SELECT "groups"."group_name" FROM "groups" INNER JOIN "group_friends" ON "groups"."id" = "group_friends"."group_id" WHERE "group_friends"."friend_id" = $1  [["friend_id", 24]]
---
  def group_names
    return friend.groups.pluck(:group_name)